#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

int main()
{
	int arr[3][3] = { {1, 2, 3}, {4, 5, 6,}, {7, 8, 9 } };//二维数组的初始化
	int i = 0;
	int j = 0;

	for (i = 0; i < 3; i++)//i用于控制行数
	{
		for (j = 0; j < 3; j++)//j用于控制列数
		{
			printf("%d ", arr[i][j]);//打印行和列
		}

		printf("\n");//打完一行就换行

	}

	return 0;
}

//int main()
//{
//	int arr1[][3] = { { 1, 2, 3}, { 4, 5, 6}, { 7, 8, 9} };//二维数组初始化的时候能省略行但是列不能省略
//	int arr2[3][3] = { { 1, 2, 3}, { 4, 5, 6}, { 7} };//如果不完全初始化的话会和一维数组一样自动补零，7后面全是零
//	int arr3[3][3] = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };//这样初始化的效果和第一个一样如果加上括号自己能更好的分辨
//	return 0;
//}

//int main()
//{
//	int arr[10] = { 0 };
//	int i = 0;
//
//	for (i = 0; i < 10; i++)
//	{
//		printf("&arr[%d]=%p\n", i, &arr[i]);
//	}
//
//	return 0;
//}

//int main()
//{
//	char arr1[] = { 'a', 'b', 'c' };//不会补零
//	char arr2[] = "abc";//会补零
//
//	return 0;
//}

//int main()
//{
//	int arr1[10] = { 1 };//这是不完全初始化，不完全初始化后面默认放0
//	int arr2[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };//这是完全初始化
//	int arr3[] = { 0 };//如果下标不给定个数它会根据{}内有多少个元素来给下标
//	int arr4[10] = { 0 };//给定了十个元素初始化一个后面如果不给值默认是零
//	char arr5[10] = { 'a', 'b', 'c' };//初始化3个元素剩下的补零
//	char arr6[10] = "abc";//初始化3个剩下的补零
//
//	return 0;
//}